// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, 
// какое число большее, а какое меньшее.

Console.Clear();

int a = -9;
int b = -3;

int max = a;

if (b > max) max = b;
{
    Console.Write("Большее число = ");
    Console.WriteLine(max);
}
    

